 <?php
try {
    $conn = mysqli_connect('localhost', 'id21822860_root', 'Learnify@123', 'id21822860_learnify');
}
catch(Exception $e) {
    $error_code = $e->getCode();
    $errors_mysql = array(
        1044 => 'خطأ: حدث خطأ في صلاحيات الوصول إلى قاعدة البيانات.',
        1045 => 'خطأ: اسم المستخدم أو كلمة المرور غير صحيحة.',
        1054 => 'خطأ: اسم العمود المحدد غير موجود في الجدول.',
        1062 => 'خطأ: تم إدخال قيمة مكررة في حقل يتطلب عدم تكرار القيم.',
        1146 => 'خطأ: اسم الجدول المحدد غير موجود في قاعدة البيانات.',
        1216 => 'خطأ: يتطلب إضافة صف في جدول الأب قيمة محددة في جدول الابن.',
        1217 => 'خطأ: يتطلب حذف أو تحديث صف في جدول الأب حذف أو تحديث صف في جدول الابن.',
        1364 => 'خطأ: يتطلب حقل معين قيمة لا تقبل القيم الفارغة.',
        1451 => 'خطأ: يتطلب حذف أو تحديث صف في جدول الأب حذف أو تحديث صف في جدول الابن.',
        1452 => 'خطأ: يتطلب إضافة صف في جدول الأب قيمة محددة في جدول الابن.',
        1644 => 'خطأ: قاعدة البيانات تحتوي على الحد الأقصى لعدد الجداول المسموح بها.',
        1690 => 'خطأ: قيمة double خارج النطاق المسموح به.',
        1822 => 'خطأ: خطأ في إضافة القيد الخارجي للجدول.',
        2002 => 'خطأ: حدث خطأ في الاتصال بخادم MySQL.',
        2006 => 'خطأ: يرجى التحقق من حالة الخادم والاتصال به مرة أخرى.',
        2013 => 'خطأ: فقدان الاتصال بخادم MySQL خلال الاستعلام.',
        2049 => 'خطأ: يرجى التحقق من إصدار الخادم وترقيته إذا لزم الأمر.',
        2054 => 'خطأ: تعذر العثور على مجموعة الأحرف المطلوبة في الخادم.',
        2087 => 'خطأ: قيمة غير صالحة تم تمريرها إلى دالة مخزنة.',
        3037 => 'خطأ: لا يمكن تنفيذ العملية عندما يتم إسقاط الجدول.',
        // يمكن إضافة المزيد من الأخطاء والرسائل المخصصة حسب متطلبات التطبيق الخاص بك.
    );

    if(isset($errors_mysql[$error_code]))
        echo $errors_mysql[$error_code];
}
?>